Feature: Работа със задачи

	Background:
	 Given Потребителят отваря екрана за работа със задача

       
    Scenario Outline: Създаване на задача
    When Въведе <име> на име
    And въведе <статус> на статус на задача
    And натисне бутона за създаване на задача
    Then Вижда съобщение: <съобщение>

    Examples: 
      | име     | статус | съобщение  								  |
      | задача1 |  нова  | Успешно създаване на задача! |
      | задача2 |  нова  | Успешно създаване на задача! |
      | задача3 |  нова  | Успешно създаване на задача! |
    
    
   Scenario Outline: Създаване на подзадача
    When Въведе <име> на име 
    And въведе <статус> на статус на задача
    And натисне бутона за създаване на подзадача
    Then Вижда съобщение: <съобщение>

    Examples: 
      | име        | статус | съобщение  								   |
      | подзадача1 |  нова  | Успешно създаване на задача! |
      | подзадача2 |  нова  | Успешно създаване на задача! |
      | подзадача3 |  нова  | Успешно създаване на задача! |
    

    
      Scenario Outline: Смяна на статус на завършена задача
    When Въведе <име> на име
    And въведе <статус> на статус на задача
    And натисне бутона за създаване на задача
    Then Вижда съобщение: <съобщение>

    Examples: 
      | име     | статус | съобщение  							 |
      | задача1 |  стат1 | Въведете валиден статус!  |
      | задача2 |  стат2 | Въведете валиден статус!  |
    
    
   Scenario Outline: Започване на работа по задача 
    When Въведе <задача>  
    And въведе <име> на разработчик
    And натисне бутона за започване на работа по задача
    Then Вижда съобщение: <съобщение>

    Examples: 
      | задача     |   име  						| съобщение  								             |
      | задача1    |  Станислав Иванов  | Успешно започване на работа по задача! |
      
    

    
   Scenario Outline: Започване на работа по задача с невалидно име на разработчик 
    When Въведе <задача>  
    And въведе <име> на разработчик
    And натисне бутона за започване на работа по задача
    Then Вижда съобщение: <съобщение>

    Examples: 
      | задача     |   име  						| съобщение  								             |
      | задача1    |  Димитър Иванов    | Въведете валидно име на разработчик!   |
     
    
   Scenario Outline: Смяна на статус на задача
    When Въведе <име> на име
    And въведе <статус> на статус на задача
    And натисне бутона за промяна на статус на задача
    Then Вижда съобщение: <съобщение>

    Examples: 
      | име     | статус 									 | съобщение  												     |
      | задача5 |  в процес на разработка  | Успешно променихте статуса на задачата! |
      | задача87 |  в процес на разработка | Успешно променихте статуса на задачата! |
    
 
  Scenario Outline: Смяна на статус на завършена задача
    When Въведе <име> на име
    And въведе <статус> на статус на задача
    And натисне бутона за промяна на статус на задача
    Then Вижда съобщение: <съобщение>

    Examples: 
      | име     | статус | съобщение  																					|
      | задача1 |  стара | Статусът на завършена задача не може да бъде сменен! |
      | задача2 |  нова  | Статусът на завършена задача не може да бъде сменен! |

    


