Feature: Вход в система

	Background:
	 Given Потребителят отваря екрана за вход системата

  Scenario: Вход в системата с валидни потребителски данни   
    When Въведе валидно потребителско име
    And въведе валидна потребителска парола
    And натисне бутона за вход в системата
    Then Вижда съобщение за успех
    
   Scenario: Вход в системата без парола
    When Въведе валидно потребителско име
    And натисне бутона за вход в системата
    Then Вижда съобщение за липсващи данни
    
   Scenario: Вход в системата без потребителско име
    When въведе валидна потребителска парола
    And натисне бутона за вход в системата
    Then Вижда съобщение за липсващи данни

   Scenario: Вход в системата без потребителски данни
    When натисне бутона за вход в системата
    Then Вижда съобщение за липсващи данни

   Scenario: Вход в системата с невалидни потребителски данни
    When Въведе невалидно потребителско име
    And въведе валидна потребителска парола
    And натисне бутона за вход в системата
    Then Вижда съобщение за неуспех

